loadtest/results/2026-08-13/p2_auth_vu700.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed-auth-step.js
        output: -

     scenarios: (100.00%) 1 scenario, 700 max VUs, 2m0s max duration (incl. graceful stop):
              * default: 700 looping VUs for 1m30s (gracefulStop: 30s)


running (0m00.6s), 700/700 VUs, 50 complete and 0 interrupted iterations
default   [   1% ] 700 VUs  0m00.5s/1m30s

running (0m01.6s), 700/700 VUs, 198 complete and 0 interrupted iterations
default   [   2% ] 700 VUs  0m01.5s/1m30s

running (0m02.6s), 700/700 VUs, 345 complete and 0 interrupted iterations
default   [   3% ] 700 VUs  0m02.5s/1m30s

running (0m03.6s), 700/700 VUs, 494 complete and 0 interrupted iterations
default   [   4% ] 700 VUs  0m03.5s/1m30s

running (0m04.6s), 700/700 VUs, 644 complete and 0 interrupted iterations
default   [   5% ] 700 VUs  0m04.5s/1m30s

running (0m05.6s), 700/700 VUs, 790 complete and 0 interrupted iterations
default   [   6% ] 700 VUs  0m05.5s/1m30s

running (0m06.6s), 700/700 VUs, 939 complete and 0 interrupted iterations
default   [   7% ] 700 VUs  0m06.5s/1m30s

running (0m07.6s), 700/700 VUs, 1089 complete and 0 interrupted iterations
default   [   8% ] 700 VUs  0m07.5s/1m30s

running (0m08.6s), 700/700 VUs, 1237 complete and 0 interrupted iterations
default   [   9% ] 700 VUs  0m08.5s/1m30s

running (0m09.6s), 700/700 VUs, 1389 complete and 0 interrupted iterations
default   [  11% ] 700 VUs  0m09.5s/1m30s

running (0m10.6s), 700/700 VUs, 1533 complete and 0 interrupted iterations
default   [  12% ] 700 VUs  0m10.5s/1m30s

running (0m11.6s), 700/700 VUs, 1686 complete and 0 interrupted iterations
default   [  13% ] 700 VUs  0m11.5s/1m30s

running (0m12.6s), 700/700 VUs, 1834 complete and 0 interrupted iterations
default   [  14% ] 700 VUs  0m12.5s/1m30s

running (0m13.6s), 700/700 VUs, 1985 complete and 0 interrupted iterations
default   [  15% ] 700 VUs  0m13.5s/1m30s

running (0m14.6s), 700/700 VUs, 2135 complete and 0 interrupted iterations
default   [  16% ] 700 VUs  0m14.5s/1m30s

running (0m15.6s), 700/700 VUs, 2280 complete and 0 interrupted iterations
default   [  17% ] 700 VUs  0m15.5s/1m30s

running (0m16.6s), 700/700 VUs, 2432 complete and 0 interrupted iterations
default   [  18% ] 700 VUs  0m16.5s/1m30s

running (0m17.6s), 700/700 VUs, 2574 complete and 0 interrupted iterations
default   [  19% ] 700 VUs  0m17.5s/1m30s

running (0m18.6s), 700/700 VUs, 2723 complete and 0 interrupted iterations
default   [  21% ] 700 VUs  0m18.5s/1m30s

running (0m19.6s), 700/700 VUs, 2857 complete and 0 interrupted iterations
default   [  22% ] 700 VUs  0m19.5s/1m30s

running (0m20.6s), 700/700 VUs, 3004 complete and 0 interrupted iterations
default   [  23% ] 700 VUs  0m20.5s/1m30s

running (0m21.6s), 700/700 VUs, 3149 complete and 0 interrupted iterations
default   [  24% ] 700 VUs  0m21.5s/1m30s

running (0m22.6s), 700/700 VUs, 3299 complete and 0 interrupted iterations
default   [  25% ] 700 VUs  0m22.5s/1m30s

running (0m23.6s), 700/700 VUs, 3447 complete and 0 interrupted iterations
default   [  26% ] 700 VUs  0m23.5s/1m30s

running (0m24.6s), 700/700 VUs, 3596 complete and 0 interrupted iterations
default   [  27% ] 700 VUs  0m24.5s/1m30s

running (0m25.6s), 700/700 VUs, 3748 complete and 0 interrupted iterations
default   [  28% ] 700 VUs  0m25.5s/1m30s

running (0m26.6s), 700/700 VUs, 3891 complete and 0 interrupted iterations
default   [  29% ] 700 VUs  0m26.5s/1m30s

running (0m27.6s), 700/700 VUs, 4039 complete and 0 interrupted iterations
default   [  31% ] 700 VUs  0m27.5s/1m30s

running (0m28.6s), 700/700 VUs, 4190 complete and 0 interrupted iterations
default   [  32% ] 700 VUs  0m28.5s/1m30s

running (0m29.6s), 700/700 VUs, 4340 complete and 0 interrupted iterations
default   [  33% ] 700 VUs  0m29.5s/1m30s

running (0m30.6s), 700/700 VUs, 4489 complete and 0 interrupted iterations
default   [  34% ] 700 VUs  0m30.5s/1m30s

running (0m31.6s), 700/700 VUs, 4627 complete and 0 interrupted iterations
default   [  35% ] 700 VUs  0m31.5s/1m30s

running (0m32.6s), 700/700 VUs, 4773 complete and 0 interrupted iterations
default   [  36% ] 700 VUs  0m32.5s/1m30s

running (0m33.6s), 700/700 VUs, 4922 complete and 0 interrupted iterations
default   [  37% ] 700 VUs  0m33.5s/1m30s

running (0m34.6s), 700/700 VUs, 5072 complete and 0 interrupted iterations
default   [  38% ] 700 VUs  0m34.5s/1m30s

running (0m35.6s), 700/700 VUs, 5219 complete and 0 interrupted iterations
default   [  39% ] 700 VUs  0m35.5s/1m30s

running (0m36.6s), 700/700 VUs, 5366 complete and 0 interrupted iterations
default   [  41% ] 700 VUs  0m36.5s/1m30s

running (0m37.6s), 700/700 VUs, 5516 complete and 0 interrupted iterations
default   [  42% ] 700 VUs  0m37.5s/1m30s

running (0m38.6s), 700/700 VUs, 5664 complete and 0 interrupted iterations
default   [  43% ] 700 VUs  0m38.5s/1m30s

running (0m39.6s), 700/700 VUs, 5817 complete and 0 interrupted iterations
default   [  44% ] 700 VUs  0m39.5s/1m30s

running (0m40.6s), 700/700 VUs, 5966 complete and 0 interrupted iterations
default   [  45% ] 700 VUs  0m40.5s/1m30s

running (0m41.6s), 700/700 VUs, 6104 complete and 0 interrupted iterations
default   [  46% ] 700 VUs  0m41.5s/1m30s

running (0m42.6s), 700/700 VUs, 6252 complete and 0 interrupted iterations
default   [  47% ] 700 VUs  0m42.5s/1m30s

running (0m43.6s), 700/700 VUs, 6400 complete and 0 interrupted iterations
default   [  48% ] 700 VUs  0m43.5s/1m30s

running (0m44.6s), 700/700 VUs, 6549 complete and 0 interrupted iterations
default   [  49% ] 700 VUs  0m44.5s/1m30s

running (0m45.6s), 700/700 VUs, 6696 complete and 0 interrupted iterations
default   [  51% ] 700 VUs  0m45.5s/1m30s

running (0m46.6s), 700/700 VUs, 6845 complete and 0 interrupted iterations
default   [  52% ] 700 VUs  0m46.5s/1m30s

running (0m47.6s), 700/700 VUs, 6992 complete and 0 interrupted iterations
default   [  53% ] 700 VUs  0m47.5s/1m30s

running (0m48.6s), 700/700 VUs, 7143 complete and 0 interrupted iterations
default   [  54% ] 700 VUs  0m48.5s/1m30s

running (0m49.6s), 700/700 VUs, 7293 complete and 0 interrupted iterations
default   [  55% ] 700 VUs  0m49.5s/1m30s

running (0m50.6s), 700/700 VUs, 7442 complete and 0 interrupted iterations
default   [  56% ] 700 VUs  0m50.5s/1m30s

running (0m51.6s), 700/700 VUs, 7592 complete and 0 interrupted iterations
default   [  57% ] 700 VUs  0m51.5s/1m30s

running (0m52.6s), 700/700 VUs, 7735 complete and 0 interrupted iterations
default   [  58% ] 700 VUs  0m52.5s/1m30s

running (0m53.6s), 700/700 VUs, 7881 complete and 0 interrupted iterations
default   [  59% ] 700 VUs  0m53.5s/1m30s

running (0m54.6s), 700/700 VUs, 8033 complete and 0 interrupted iterations
default   [  61% ] 700 VUs  0m54.5s/1m30s

running (0m55.6s), 700/700 VUs, 8182 complete and 0 interrupted iterations
default   [  62% ] 700 VUs  0m55.5s/1m30s

running (0m56.6s), 700/700 VUs, 8333 complete and 0 interrupted iterations
default   [  63% ] 700 VUs  0m56.5s/1m30s

running (0m57.6s), 700/700 VUs, 8477 complete and 0 interrupted iterations
default   [  64% ] 700 VUs  0m57.5s/1m30s

running (0m58.6s), 700/700 VUs, 8625 complete and 0 interrupted iterations
default   [  65% ] 700 VUs  0m58.5s/1m30s

running (0m59.6s), 700/700 VUs, 8776 complete and 0 interrupted iterations
default   [  66% ] 700 VUs  0m59.5s/1m30s

running (1m00.6s), 700/700 VUs, 8927 complete and 0 interrupted iterations
default   [  67% ] 700 VUs  1m00.5s/1m30s

running (1m01.6s), 700/700 VUs, 9078 complete and 0 interrupted iterations
default   [  68% ] 700 VUs  1m01.5s/1m30s

running (1m02.6s), 700/700 VUs, 9226 complete and 0 interrupted iterations
default   [  69% ] 700 VUs  1m02.5s/1m30s

running (1m03.6s), 700/700 VUs, 9372 complete and 0 interrupted iterations
default   [  71% ] 700 VUs  1m03.5s/1m30s

running (1m04.6s), 700/700 VUs, 9521 complete and 0 interrupted iterations
default   [  72% ] 700 VUs  1m04.5s/1m30s

running (1m05.6s), 700/700 VUs, 9667 complete and 0 interrupted iterations
default   [  73% ] 700 VUs  1m05.5s/1m30s

running (1m06.6s), 700/700 VUs, 9816 complete and 0 interrupted iterations
default   [  74% ] 700 VUs  1m06.5s/1m30s

running (1m07.6s), 700/700 VUs, 9963 complete and 0 interrupted iterations
default   [  75% ] 700 VUs  1m07.5s/1m30s

running (1m08.6s), 700/700 VUs, 10111 complete and 0 interrupted iterations
default   [  76% ] 700 VUs  1m08.5s/1m30s

running (1m09.6s), 700/700 VUs, 10259 complete and 0 interrupted iterations
default   [  77% ] 700 VUs  1m09.5s/1m30s

running (1m10.6s), 700/700 VUs, 10409 complete and 0 interrupted iterations
default   [  78% ] 700 VUs  1m10.5s/1m30s

running (1m11.6s), 700/700 VUs, 10556 complete and 0 interrupted iterations
default   [  79% ] 700 VUs  1m11.5s/1m30s

running (1m12.6s), 700/700 VUs, 10703 complete and 0 interrupted iterations
default   [  81% ] 700 VUs  1m12.5s/1m30s

running (1m13.6s), 700/700 VUs, 10838 complete and 0 interrupted iterations
default   [  82% ] 700 VUs  1m13.5s/1m30s

running (1m14.6s), 700/700 VUs, 10976 complete and 0 interrupted iterations
default   [  83% ] 700 VUs  1m14.5s/1m30s

running (1m15.6s), 700/700 VUs, 11124 complete and 0 interrupted iterations
default   [  84% ] 700 VUs  1m15.5s/1m30s

running (1m16.6s), 700/700 VUs, 11277 complete and 0 interrupted iterations
default   [  85% ] 700 VUs  1m16.5s/1m30s

running (1m17.6s), 700/700 VUs, 11424 complete and 0 interrupted iterations
default   [  86% ] 700 VUs  1m17.5s/1m30s

running (1m18.6s), 700/700 VUs, 11569 complete and 0 interrupted iterations
default   [  87% ] 700 VUs  1m18.5s/1m30s

running (1m19.6s), 700/700 VUs, 11716 complete and 0 interrupted iterations
default   [  88% ] 700 VUs  1m19.5s/1m30s

running (1m20.6s), 700/700 VUs, 11863 complete and 0 interrupted iterations
default   [  89% ] 700 VUs  1m20.5s/1m30s

running (1m21.6s), 700/700 VUs, 12011 complete and 0 interrupted iterations
default   [  91% ] 700 VUs  1m21.5s/1m30s

running (1m22.6s), 700/700 VUs, 12147 complete and 0 interrupted iterations
default   [  92% ] 700 VUs  1m22.5s/1m30s

running (1m23.6s), 700/700 VUs, 12293 complete and 0 interrupted iterations
default   [  93% ] 700 VUs  1m23.5s/1m30s

running (1m24.6s), 700/700 VUs, 12443 complete and 0 interrupted iterations
default   [  94% ] 700 VUs  1m24.5s/1m30s

running (1m25.6s), 700/700 VUs, 12592 complete and 0 interrupted iterations
default   [  95% ] 700 VUs  1m25.5s/1m30s

running (1m26.6s), 700/700 VUs, 12741 complete and 0 interrupted iterations
default   [  96% ] 700 VUs  1m26.5s/1m30s

running (1m27.6s), 700/700 VUs, 12890 complete and 0 interrupted iterations
default   [  97% ] 700 VUs  1m27.5s/1m30s

running (1m28.6s), 700/700 VUs, 13032 complete and 0 interrupted iterations
default   [  98% ] 700 VUs  1m28.5s/1m30s

running (1m29.6s), 700/700 VUs, 13180 complete and 0 interrupted iterations
default   [  99% ] 700 VUs  1m29.5s/1m30s

running (1m30.6s), 616/700 VUs, 13332 complete and 0 interrupted iterations
default ↓ [ 100% ] 700 VUs  1m30s

running (1m31.6s), 465/700 VUs, 13483 complete and 0 interrupted iterations
default ↓ [ 100% ] 700 VUs  1m30s

running (1m32.6s), 313/700 VUs, 13635 complete and 0 interrupted iterations
default ↓ [ 100% ] 700 VUs  1m30s

running (1m33.6s), 167/700 VUs, 13781 complete and 0 interrupted iterations
default ↓ [ 100% ] 700 VUs  1m30s

running (1m34.6s), 018/700 VUs, 13930 complete and 0 interrupted iterations
default ↓ [ 100% ] 700 VUs  1m30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 27896   294.432147/s
    checks_succeeded...: 100.00% 27896 out of 27896
    checks_failed......: 0.00%   0 out of 27896

    ✓ status 200
    ✓ 본문 있음

    CUSTOM
    feed_auth_duration.............: avg=4.62s min=121.04ms med=4.72s p(90)=4.86s p(95)=5.94s p(99)=6.09s max=7.42s

    HTTP
    http_req_duration..............: avg=4.62s min=93.82ms  med=4.72s p(90)=4.86s p(95)=5.94s p(99)=6.09s max=7.42s
      { expected_response:true }...: avg=4.62s min=93.82ms  med=4.72s p(90)=4.86s p(95)=5.94s p(99)=6.09s max=7.42s
    http_req_failed................: 0.00%  0 out of 13949
    http_reqs......................: 13949  147.226628/s

    EXECUTION
    iteration_duration.............: avg=4.62s min=157.62ms med=4.72s p(90)=4.86s p(95)=5.94s p(99)=6.1s  max=7.46s
    iterations.....................: 13948  147.216074/s
    vus............................: 18     min=18         max=700
    vus_max........................: 700    min=700        max=700

    NETWORK
    data_received..................: 202 MB 2.1 MB/s
    data_sent......................: 4.4 MB 47 kB/s



running (1m34.7s), 000/700 VUs, 13948 complete and 0 interrupted iterations
default ✓ [ 100% ] 700 VUs  1m30s